###############################################################################
# Created by write_sdc
# Sat Dec 21 23:55:28 2024
###############################################################################
current_design BlockRAM_1KB
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 40.0000 [get_ports {clk}]
set_clock_transition 0.1500 [get_clocks {clk}]
set_clock_uncertainty 0.2500 clk
set_propagated_clock [get_clocks {clk}]
set_input_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {C0}]
set_input_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {C1}]
set_input_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {C2}]
set_input_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {C3}]
set_input_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {C4}]
set_input_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {C5}]
set_input_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rd_addr[0]}]
set_input_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rd_addr[1]}]
set_input_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rd_addr[2]}]
set_input_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rd_addr[3]}]
set_input_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rd_addr[4]}]
set_input_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rd_addr[5]}]
set_input_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rd_addr[6]}]
set_input_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rd_addr[7]}]
set_input_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wr_addr[0]}]
set_input_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wr_addr[1]}]
set_input_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wr_addr[2]}]
set_input_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wr_addr[3]}]
set_input_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wr_addr[4]}]
set_input_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wr_addr[5]}]
set_input_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wr_addr[6]}]
set_input_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wr_addr[7]}]
set_input_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wr_data[0]}]
set_input_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wr_data[10]}]
set_input_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wr_data[11]}]
set_input_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wr_data[12]}]
set_input_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wr_data[13]}]
set_input_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wr_data[14]}]
set_input_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wr_data[15]}]
set_input_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wr_data[16]}]
set_input_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wr_data[17]}]
set_input_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wr_data[18]}]
set_input_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wr_data[19]}]
set_input_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wr_data[1]}]
set_input_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wr_data[20]}]
set_input_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wr_data[21]}]
set_input_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wr_data[22]}]
set_input_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wr_data[23]}]
set_input_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wr_data[24]}]
set_input_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wr_data[25]}]
set_input_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wr_data[26]}]
set_input_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wr_data[27]}]
set_input_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wr_data[28]}]
set_input_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wr_data[29]}]
set_input_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wr_data[2]}]
set_input_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wr_data[30]}]
set_input_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wr_data[31]}]
set_input_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wr_data[3]}]
set_input_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wr_data[4]}]
set_input_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wr_data[5]}]
set_input_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wr_data[6]}]
set_input_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wr_data[7]}]
set_input_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wr_data[8]}]
set_input_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wr_data[9]}]
set_output_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rd_data[0]}]
set_output_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rd_data[10]}]
set_output_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rd_data[11]}]
set_output_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rd_data[12]}]
set_output_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rd_data[13]}]
set_output_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rd_data[14]}]
set_output_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rd_data[15]}]
set_output_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rd_data[16]}]
set_output_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rd_data[17]}]
set_output_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rd_data[18]}]
set_output_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rd_data[19]}]
set_output_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rd_data[1]}]
set_output_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rd_data[20]}]
set_output_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rd_data[21]}]
set_output_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rd_data[22]}]
set_output_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rd_data[23]}]
set_output_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rd_data[24]}]
set_output_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rd_data[25]}]
set_output_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rd_data[26]}]
set_output_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rd_data[27]}]
set_output_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rd_data[28]}]
set_output_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rd_data[29]}]
set_output_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rd_data[2]}]
set_output_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rd_data[30]}]
set_output_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rd_data[31]}]
set_output_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rd_data[3]}]
set_output_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rd_data[4]}]
set_output_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rd_data[5]}]
set_output_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rd_data[6]}]
set_output_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rd_data[7]}]
set_output_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rd_data[8]}]
set_output_delay 8.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rd_data[9]}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0334 [get_ports {rd_data[31]}]
set_load -pin_load 0.0334 [get_ports {rd_data[30]}]
set_load -pin_load 0.0334 [get_ports {rd_data[29]}]
set_load -pin_load 0.0334 [get_ports {rd_data[28]}]
set_load -pin_load 0.0334 [get_ports {rd_data[27]}]
set_load -pin_load 0.0334 [get_ports {rd_data[26]}]
set_load -pin_load 0.0334 [get_ports {rd_data[25]}]
set_load -pin_load 0.0334 [get_ports {rd_data[24]}]
set_load -pin_load 0.0334 [get_ports {rd_data[23]}]
set_load -pin_load 0.0334 [get_ports {rd_data[22]}]
set_load -pin_load 0.0334 [get_ports {rd_data[21]}]
set_load -pin_load 0.0334 [get_ports {rd_data[20]}]
set_load -pin_load 0.0334 [get_ports {rd_data[19]}]
set_load -pin_load 0.0334 [get_ports {rd_data[18]}]
set_load -pin_load 0.0334 [get_ports {rd_data[17]}]
set_load -pin_load 0.0334 [get_ports {rd_data[16]}]
set_load -pin_load 0.0334 [get_ports {rd_data[15]}]
set_load -pin_load 0.0334 [get_ports {rd_data[14]}]
set_load -pin_load 0.0334 [get_ports {rd_data[13]}]
set_load -pin_load 0.0334 [get_ports {rd_data[12]}]
set_load -pin_load 0.0334 [get_ports {rd_data[11]}]
set_load -pin_load 0.0334 [get_ports {rd_data[10]}]
set_load -pin_load 0.0334 [get_ports {rd_data[9]}]
set_load -pin_load 0.0334 [get_ports {rd_data[8]}]
set_load -pin_load 0.0334 [get_ports {rd_data[7]}]
set_load -pin_load 0.0334 [get_ports {rd_data[6]}]
set_load -pin_load 0.0334 [get_ports {rd_data[5]}]
set_load -pin_load 0.0334 [get_ports {rd_data[4]}]
set_load -pin_load 0.0334 [get_ports {rd_data[3]}]
set_load -pin_load 0.0334 [get_ports {rd_data[2]}]
set_load -pin_load 0.0334 [get_ports {rd_data[1]}]
set_load -pin_load 0.0334 [get_ports {rd_data[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {C0}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {C1}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {C2}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {C3}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {C4}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {C5}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clk}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rd_addr[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rd_addr[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rd_addr[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rd_addr[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rd_addr[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rd_addr[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rd_addr[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rd_addr[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wr_addr[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wr_addr[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wr_addr[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wr_addr[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wr_addr[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wr_addr[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wr_addr[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wr_addr[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wr_data[31]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wr_data[30]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wr_data[29]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wr_data[28]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wr_data[27]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wr_data[26]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wr_data[25]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wr_data[24]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wr_data[23]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wr_data[22]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wr_data[21]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wr_data[20]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wr_data[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wr_data[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wr_data[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wr_data[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wr_data[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wr_data[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wr_data[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wr_data[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wr_data[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wr_data[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wr_data[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wr_data[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wr_data[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wr_data[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wr_data[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wr_data[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wr_data[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wr_data[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wr_data[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wr_data[0]}]
set_timing_derate -early 0.9500
set_timing_derate -late 1.0500
###############################################################################
# Design Rules
###############################################################################
set_max_transition 0.7500 [current_design]
set_max_fanout 5.0000 [current_design]
