###############################################################################
# Created by write_sdc
# Fri Dec 20 00:34:46 2024
###############################################################################
current_design eFPGA_Config
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name UserCLK -period 40.0000 
set_input_delay 8.0000 -clock [get_clocks {UserCLK}] -add_delay [get_ports {CLK}]
set_input_delay 8.0000 -clock [get_clocks {UserCLK}] -add_delay [get_ports {Rx}]
set_input_delay 8.0000 -clock [get_clocks {UserCLK}] -add_delay [get_ports {SelfWriteData[0]}]
set_input_delay 8.0000 -clock [get_clocks {UserCLK}] -add_delay [get_ports {SelfWriteData[10]}]
set_input_delay 8.0000 -clock [get_clocks {UserCLK}] -add_delay [get_ports {SelfWriteData[11]}]
set_input_delay 8.0000 -clock [get_clocks {UserCLK}] -add_delay [get_ports {SelfWriteData[12]}]
set_input_delay 8.0000 -clock [get_clocks {UserCLK}] -add_delay [get_ports {SelfWriteData[13]}]
set_input_delay 8.0000 -clock [get_clocks {UserCLK}] -add_delay [get_ports {SelfWriteData[14]}]
set_input_delay 8.0000 -clock [get_clocks {UserCLK}] -add_delay [get_ports {SelfWriteData[15]}]
set_input_delay 8.0000 -clock [get_clocks {UserCLK}] -add_delay [get_ports {SelfWriteData[16]}]
set_input_delay 8.0000 -clock [get_clocks {UserCLK}] -add_delay [get_ports {SelfWriteData[17]}]
set_input_delay 8.0000 -clock [get_clocks {UserCLK}] -add_delay [get_ports {SelfWriteData[18]}]
set_input_delay 8.0000 -clock [get_clocks {UserCLK}] -add_delay [get_ports {SelfWriteData[19]}]
set_input_delay 8.0000 -clock [get_clocks {UserCLK}] -add_delay [get_ports {SelfWriteData[1]}]
set_input_delay 8.0000 -clock [get_clocks {UserCLK}] -add_delay [get_ports {SelfWriteData[20]}]
set_input_delay 8.0000 -clock [get_clocks {UserCLK}] -add_delay [get_ports {SelfWriteData[21]}]
set_input_delay 8.0000 -clock [get_clocks {UserCLK}] -add_delay [get_ports {SelfWriteData[22]}]
set_input_delay 8.0000 -clock [get_clocks {UserCLK}] -add_delay [get_ports {SelfWriteData[23]}]
set_input_delay 8.0000 -clock [get_clocks {UserCLK}] -add_delay [get_ports {SelfWriteData[24]}]
set_input_delay 8.0000 -clock [get_clocks {UserCLK}] -add_delay [get_ports {SelfWriteData[25]}]
set_input_delay 8.0000 -clock [get_clocks {UserCLK}] -add_delay [get_ports {SelfWriteData[26]}]
set_input_delay 8.0000 -clock [get_clocks {UserCLK}] -add_delay [get_ports {SelfWriteData[27]}]
set_input_delay 8.0000 -clock [get_clocks {UserCLK}] -add_delay [get_ports {SelfWriteData[28]}]
set_input_delay 8.0000 -clock [get_clocks {UserCLK}] -add_delay [get_ports {SelfWriteData[29]}]
set_input_delay 8.0000 -clock [get_clocks {UserCLK}] -add_delay [get_ports {SelfWriteData[2]}]
set_input_delay 8.0000 -clock [get_clocks {UserCLK}] -add_delay [get_ports {SelfWriteData[30]}]
set_input_delay 8.0000 -clock [get_clocks {UserCLK}] -add_delay [get_ports {SelfWriteData[31]}]
set_input_delay 8.0000 -clock [get_clocks {UserCLK}] -add_delay [get_ports {SelfWriteData[3]}]
set_input_delay 8.0000 -clock [get_clocks {UserCLK}] -add_delay [get_ports {SelfWriteData[4]}]
set_input_delay 8.0000 -clock [get_clocks {UserCLK}] -add_delay [get_ports {SelfWriteData[5]}]
set_input_delay 8.0000 -clock [get_clocks {UserCLK}] -add_delay [get_ports {SelfWriteData[6]}]
set_input_delay 8.0000 -clock [get_clocks {UserCLK}] -add_delay [get_ports {SelfWriteData[7]}]
set_input_delay 8.0000 -clock [get_clocks {UserCLK}] -add_delay [get_ports {SelfWriteData[8]}]
set_input_delay 8.0000 -clock [get_clocks {UserCLK}] -add_delay [get_ports {SelfWriteData[9]}]
set_input_delay 8.0000 -clock [get_clocks {UserCLK}] -add_delay [get_ports {SelfWriteStrobe}]
set_input_delay 8.0000 -clock [get_clocks {UserCLK}] -add_delay [get_ports {resetn}]
set_input_delay 8.0000 -clock [get_clocks {UserCLK}] -add_delay [get_ports {s_clk}]
set_input_delay 8.0000 -clock [get_clocks {UserCLK}] -add_delay [get_ports {s_data}]
set_output_delay 8.0000 -clock [get_clocks {UserCLK}] -add_delay [get_ports {ComActive}]
set_output_delay 8.0000 -clock [get_clocks {UserCLK}] -add_delay [get_ports {ConfigWriteData[0]}]
set_output_delay 8.0000 -clock [get_clocks {UserCLK}] -add_delay [get_ports {ConfigWriteData[10]}]
set_output_delay 8.0000 -clock [get_clocks {UserCLK}] -add_delay [get_ports {ConfigWriteData[11]}]
set_output_delay 8.0000 -clock [get_clocks {UserCLK}] -add_delay [get_ports {ConfigWriteData[12]}]
set_output_delay 8.0000 -clock [get_clocks {UserCLK}] -add_delay [get_ports {ConfigWriteData[13]}]
set_output_delay 8.0000 -clock [get_clocks {UserCLK}] -add_delay [get_ports {ConfigWriteData[14]}]
set_output_delay 8.0000 -clock [get_clocks {UserCLK}] -add_delay [get_ports {ConfigWriteData[15]}]
set_output_delay 8.0000 -clock [get_clocks {UserCLK}] -add_delay [get_ports {ConfigWriteData[16]}]
set_output_delay 8.0000 -clock [get_clocks {UserCLK}] -add_delay [get_ports {ConfigWriteData[17]}]
set_output_delay 8.0000 -clock [get_clocks {UserCLK}] -add_delay [get_ports {ConfigWriteData[18]}]
set_output_delay 8.0000 -clock [get_clocks {UserCLK}] -add_delay [get_ports {ConfigWriteData[19]}]
set_output_delay 8.0000 -clock [get_clocks {UserCLK}] -add_delay [get_ports {ConfigWriteData[1]}]
set_output_delay 8.0000 -clock [get_clocks {UserCLK}] -add_delay [get_ports {ConfigWriteData[20]}]
set_output_delay 8.0000 -clock [get_clocks {UserCLK}] -add_delay [get_ports {ConfigWriteData[21]}]
set_output_delay 8.0000 -clock [get_clocks {UserCLK}] -add_delay [get_ports {ConfigWriteData[22]}]
set_output_delay 8.0000 -clock [get_clocks {UserCLK}] -add_delay [get_ports {ConfigWriteData[23]}]
set_output_delay 8.0000 -clock [get_clocks {UserCLK}] -add_delay [get_ports {ConfigWriteData[24]}]
set_output_delay 8.0000 -clock [get_clocks {UserCLK}] -add_delay [get_ports {ConfigWriteData[25]}]
set_output_delay 8.0000 -clock [get_clocks {UserCLK}] -add_delay [get_ports {ConfigWriteData[26]}]
set_output_delay 8.0000 -clock [get_clocks {UserCLK}] -add_delay [get_ports {ConfigWriteData[27]}]
set_output_delay 8.0000 -clock [get_clocks {UserCLK}] -add_delay [get_ports {ConfigWriteData[28]}]
set_output_delay 8.0000 -clock [get_clocks {UserCLK}] -add_delay [get_ports {ConfigWriteData[29]}]
set_output_delay 8.0000 -clock [get_clocks {UserCLK}] -add_delay [get_ports {ConfigWriteData[2]}]
set_output_delay 8.0000 -clock [get_clocks {UserCLK}] -add_delay [get_ports {ConfigWriteData[30]}]
set_output_delay 8.0000 -clock [get_clocks {UserCLK}] -add_delay [get_ports {ConfigWriteData[31]}]
set_output_delay 8.0000 -clock [get_clocks {UserCLK}] -add_delay [get_ports {ConfigWriteData[3]}]
set_output_delay 8.0000 -clock [get_clocks {UserCLK}] -add_delay [get_ports {ConfigWriteData[4]}]
set_output_delay 8.0000 -clock [get_clocks {UserCLK}] -add_delay [get_ports {ConfigWriteData[5]}]
set_output_delay 8.0000 -clock [get_clocks {UserCLK}] -add_delay [get_ports {ConfigWriteData[6]}]
set_output_delay 8.0000 -clock [get_clocks {UserCLK}] -add_delay [get_ports {ConfigWriteData[7]}]
set_output_delay 8.0000 -clock [get_clocks {UserCLK}] -add_delay [get_ports {ConfigWriteData[8]}]
set_output_delay 8.0000 -clock [get_clocks {UserCLK}] -add_delay [get_ports {ConfigWriteData[9]}]
set_output_delay 8.0000 -clock [get_clocks {UserCLK}] -add_delay [get_ports {ConfigWriteStrobe}]
set_output_delay 8.0000 -clock [get_clocks {UserCLK}] -add_delay [get_ports {FrameAddressRegister[0]}]
set_output_delay 8.0000 -clock [get_clocks {UserCLK}] -add_delay [get_ports {FrameAddressRegister[10]}]
set_output_delay 8.0000 -clock [get_clocks {UserCLK}] -add_delay [get_ports {FrameAddressRegister[11]}]
set_output_delay 8.0000 -clock [get_clocks {UserCLK}] -add_delay [get_ports {FrameAddressRegister[12]}]
set_output_delay 8.0000 -clock [get_clocks {UserCLK}] -add_delay [get_ports {FrameAddressRegister[13]}]
set_output_delay 8.0000 -clock [get_clocks {UserCLK}] -add_delay [get_ports {FrameAddressRegister[14]}]
set_output_delay 8.0000 -clock [get_clocks {UserCLK}] -add_delay [get_ports {FrameAddressRegister[15]}]
set_output_delay 8.0000 -clock [get_clocks {UserCLK}] -add_delay [get_ports {FrameAddressRegister[16]}]
set_output_delay 8.0000 -clock [get_clocks {UserCLK}] -add_delay [get_ports {FrameAddressRegister[17]}]
set_output_delay 8.0000 -clock [get_clocks {UserCLK}] -add_delay [get_ports {FrameAddressRegister[18]}]
set_output_delay 8.0000 -clock [get_clocks {UserCLK}] -add_delay [get_ports {FrameAddressRegister[19]}]
set_output_delay 8.0000 -clock [get_clocks {UserCLK}] -add_delay [get_ports {FrameAddressRegister[1]}]
set_output_delay 8.0000 -clock [get_clocks {UserCLK}] -add_delay [get_ports {FrameAddressRegister[20]}]
set_output_delay 8.0000 -clock [get_clocks {UserCLK}] -add_delay [get_ports {FrameAddressRegister[21]}]
set_output_delay 8.0000 -clock [get_clocks {UserCLK}] -add_delay [get_ports {FrameAddressRegister[22]}]
set_output_delay 8.0000 -clock [get_clocks {UserCLK}] -add_delay [get_ports {FrameAddressRegister[23]}]
set_output_delay 8.0000 -clock [get_clocks {UserCLK}] -add_delay [get_ports {FrameAddressRegister[24]}]
set_output_delay 8.0000 -clock [get_clocks {UserCLK}] -add_delay [get_ports {FrameAddressRegister[25]}]
set_output_delay 8.0000 -clock [get_clocks {UserCLK}] -add_delay [get_ports {FrameAddressRegister[26]}]
set_output_delay 8.0000 -clock [get_clocks {UserCLK}] -add_delay [get_ports {FrameAddressRegister[27]}]
set_output_delay 8.0000 -clock [get_clocks {UserCLK}] -add_delay [get_ports {FrameAddressRegister[28]}]
set_output_delay 8.0000 -clock [get_clocks {UserCLK}] -add_delay [get_ports {FrameAddressRegister[29]}]
set_output_delay 8.0000 -clock [get_clocks {UserCLK}] -add_delay [get_ports {FrameAddressRegister[2]}]
set_output_delay 8.0000 -clock [get_clocks {UserCLK}] -add_delay [get_ports {FrameAddressRegister[30]}]
set_output_delay 8.0000 -clock [get_clocks {UserCLK}] -add_delay [get_ports {FrameAddressRegister[31]}]
set_output_delay 8.0000 -clock [get_clocks {UserCLK}] -add_delay [get_ports {FrameAddressRegister[3]}]
set_output_delay 8.0000 -clock [get_clocks {UserCLK}] -add_delay [get_ports {FrameAddressRegister[4]}]
set_output_delay 8.0000 -clock [get_clocks {UserCLK}] -add_delay [get_ports {FrameAddressRegister[5]}]
set_output_delay 8.0000 -clock [get_clocks {UserCLK}] -add_delay [get_ports {FrameAddressRegister[6]}]
set_output_delay 8.0000 -clock [get_clocks {UserCLK}] -add_delay [get_ports {FrameAddressRegister[7]}]
set_output_delay 8.0000 -clock [get_clocks {UserCLK}] -add_delay [get_ports {FrameAddressRegister[8]}]
set_output_delay 8.0000 -clock [get_clocks {UserCLK}] -add_delay [get_ports {FrameAddressRegister[9]}]
set_output_delay 8.0000 -clock [get_clocks {UserCLK}] -add_delay [get_ports {LongFrameStrobe}]
set_output_delay 8.0000 -clock [get_clocks {UserCLK}] -add_delay [get_ports {ReceiveLED}]
set_output_delay 8.0000 -clock [get_clocks {UserCLK}] -add_delay [get_ports {RowSelect[0]}]
set_output_delay 8.0000 -clock [get_clocks {UserCLK}] -add_delay [get_ports {RowSelect[1]}]
set_output_delay 8.0000 -clock [get_clocks {UserCLK}] -add_delay [get_ports {RowSelect[2]}]
set_output_delay 8.0000 -clock [get_clocks {UserCLK}] -add_delay [get_ports {RowSelect[3]}]
set_output_delay 8.0000 -clock [get_clocks {UserCLK}] -add_delay [get_ports {RowSelect[4]}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0334 [get_ports {ComActive}]
set_load -pin_load 0.0334 [get_ports {ConfigWriteStrobe}]
set_load -pin_load 0.0334 [get_ports {LongFrameStrobe}]
set_load -pin_load 0.0334 [get_ports {ReceiveLED}]
set_load -pin_load 0.0334 [get_ports {ConfigWriteData[31]}]
set_load -pin_load 0.0334 [get_ports {ConfigWriteData[30]}]
set_load -pin_load 0.0334 [get_ports {ConfigWriteData[29]}]
set_load -pin_load 0.0334 [get_ports {ConfigWriteData[28]}]
set_load -pin_load 0.0334 [get_ports {ConfigWriteData[27]}]
set_load -pin_load 0.0334 [get_ports {ConfigWriteData[26]}]
set_load -pin_load 0.0334 [get_ports {ConfigWriteData[25]}]
set_load -pin_load 0.0334 [get_ports {ConfigWriteData[24]}]
set_load -pin_load 0.0334 [get_ports {ConfigWriteData[23]}]
set_load -pin_load 0.0334 [get_ports {ConfigWriteData[22]}]
set_load -pin_load 0.0334 [get_ports {ConfigWriteData[21]}]
set_load -pin_load 0.0334 [get_ports {ConfigWriteData[20]}]
set_load -pin_load 0.0334 [get_ports {ConfigWriteData[19]}]
set_load -pin_load 0.0334 [get_ports {ConfigWriteData[18]}]
set_load -pin_load 0.0334 [get_ports {ConfigWriteData[17]}]
set_load -pin_load 0.0334 [get_ports {ConfigWriteData[16]}]
set_load -pin_load 0.0334 [get_ports {ConfigWriteData[15]}]
set_load -pin_load 0.0334 [get_ports {ConfigWriteData[14]}]
set_load -pin_load 0.0334 [get_ports {ConfigWriteData[13]}]
set_load -pin_load 0.0334 [get_ports {ConfigWriteData[12]}]
set_load -pin_load 0.0334 [get_ports {ConfigWriteData[11]}]
set_load -pin_load 0.0334 [get_ports {ConfigWriteData[10]}]
set_load -pin_load 0.0334 [get_ports {ConfigWriteData[9]}]
set_load -pin_load 0.0334 [get_ports {ConfigWriteData[8]}]
set_load -pin_load 0.0334 [get_ports {ConfigWriteData[7]}]
set_load -pin_load 0.0334 [get_ports {ConfigWriteData[6]}]
set_load -pin_load 0.0334 [get_ports {ConfigWriteData[5]}]
set_load -pin_load 0.0334 [get_ports {ConfigWriteData[4]}]
set_load -pin_load 0.0334 [get_ports {ConfigWriteData[3]}]
set_load -pin_load 0.0334 [get_ports {ConfigWriteData[2]}]
set_load -pin_load 0.0334 [get_ports {ConfigWriteData[1]}]
set_load -pin_load 0.0334 [get_ports {ConfigWriteData[0]}]
set_load -pin_load 0.0334 [get_ports {FrameAddressRegister[31]}]
set_load -pin_load 0.0334 [get_ports {FrameAddressRegister[30]}]
set_load -pin_load 0.0334 [get_ports {FrameAddressRegister[29]}]
set_load -pin_load 0.0334 [get_ports {FrameAddressRegister[28]}]
set_load -pin_load 0.0334 [get_ports {FrameAddressRegister[27]}]
set_load -pin_load 0.0334 [get_ports {FrameAddressRegister[26]}]
set_load -pin_load 0.0334 [get_ports {FrameAddressRegister[25]}]
set_load -pin_load 0.0334 [get_ports {FrameAddressRegister[24]}]
set_load -pin_load 0.0334 [get_ports {FrameAddressRegister[23]}]
set_load -pin_load 0.0334 [get_ports {FrameAddressRegister[22]}]
set_load -pin_load 0.0334 [get_ports {FrameAddressRegister[21]}]
set_load -pin_load 0.0334 [get_ports {FrameAddressRegister[20]}]
set_load -pin_load 0.0334 [get_ports {FrameAddressRegister[19]}]
set_load -pin_load 0.0334 [get_ports {FrameAddressRegister[18]}]
set_load -pin_load 0.0334 [get_ports {FrameAddressRegister[17]}]
set_load -pin_load 0.0334 [get_ports {FrameAddressRegister[16]}]
set_load -pin_load 0.0334 [get_ports {FrameAddressRegister[15]}]
set_load -pin_load 0.0334 [get_ports {FrameAddressRegister[14]}]
set_load -pin_load 0.0334 [get_ports {FrameAddressRegister[13]}]
set_load -pin_load 0.0334 [get_ports {FrameAddressRegister[12]}]
set_load -pin_load 0.0334 [get_ports {FrameAddressRegister[11]}]
set_load -pin_load 0.0334 [get_ports {FrameAddressRegister[10]}]
set_load -pin_load 0.0334 [get_ports {FrameAddressRegister[9]}]
set_load -pin_load 0.0334 [get_ports {FrameAddressRegister[8]}]
set_load -pin_load 0.0334 [get_ports {FrameAddressRegister[7]}]
set_load -pin_load 0.0334 [get_ports {FrameAddressRegister[6]}]
set_load -pin_load 0.0334 [get_ports {FrameAddressRegister[5]}]
set_load -pin_load 0.0334 [get_ports {FrameAddressRegister[4]}]
set_load -pin_load 0.0334 [get_ports {FrameAddressRegister[3]}]
set_load -pin_load 0.0334 [get_ports {FrameAddressRegister[2]}]
set_load -pin_load 0.0334 [get_ports {FrameAddressRegister[1]}]
set_load -pin_load 0.0334 [get_ports {FrameAddressRegister[0]}]
set_load -pin_load 0.0334 [get_ports {RowSelect[4]}]
set_load -pin_load 0.0334 [get_ports {RowSelect[3]}]
set_load -pin_load 0.0334 [get_ports {RowSelect[2]}]
set_load -pin_load 0.0334 [get_ports {RowSelect[1]}]
set_load -pin_load 0.0334 [get_ports {RowSelect[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {CLK}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Rx}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {SelfWriteStrobe}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {resetn}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {s_clk}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {s_data}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {SelfWriteData[31]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {SelfWriteData[30]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {SelfWriteData[29]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {SelfWriteData[28]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {SelfWriteData[27]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {SelfWriteData[26]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {SelfWriteData[25]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {SelfWriteData[24]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {SelfWriteData[23]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {SelfWriteData[22]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {SelfWriteData[21]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {SelfWriteData[20]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {SelfWriteData[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {SelfWriteData[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {SelfWriteData[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {SelfWriteData[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {SelfWriteData[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {SelfWriteData[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {SelfWriteData[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {SelfWriteData[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {SelfWriteData[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {SelfWriteData[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {SelfWriteData[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {SelfWriteData[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {SelfWriteData[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {SelfWriteData[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {SelfWriteData[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {SelfWriteData[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {SelfWriteData[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {SelfWriteData[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {SelfWriteData[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {SelfWriteData[0]}]
###############################################################################
# Design Rules
###############################################################################
