###############################################################################
# Created by write_sdc
# Sun Dec  8 00:43:54 2024
###############################################################################
current_design S_term_single2
###############################################################################
# Timing Constraints
###############################################################################
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0334 [get_ports {UserCLKo}]
set_load -pin_load 0.0334 [get_ports {FrameStrobe_O[19]}]
set_load -pin_load 0.0334 [get_ports {FrameStrobe_O[18]}]
set_load -pin_load 0.0334 [get_ports {FrameStrobe_O[17]}]
set_load -pin_load 0.0334 [get_ports {FrameStrobe_O[16]}]
set_load -pin_load 0.0334 [get_ports {FrameStrobe_O[15]}]
set_load -pin_load 0.0334 [get_ports {FrameStrobe_O[14]}]
set_load -pin_load 0.0334 [get_ports {FrameStrobe_O[13]}]
set_load -pin_load 0.0334 [get_ports {FrameStrobe_O[12]}]
set_load -pin_load 0.0334 [get_ports {FrameStrobe_O[11]}]
set_load -pin_load 0.0334 [get_ports {FrameStrobe_O[10]}]
set_load -pin_load 0.0334 [get_ports {FrameStrobe_O[9]}]
set_load -pin_load 0.0334 [get_ports {FrameStrobe_O[8]}]
set_load -pin_load 0.0334 [get_ports {FrameStrobe_O[7]}]
set_load -pin_load 0.0334 [get_ports {FrameStrobe_O[6]}]
set_load -pin_load 0.0334 [get_ports {FrameStrobe_O[5]}]
set_load -pin_load 0.0334 [get_ports {FrameStrobe_O[4]}]
set_load -pin_load 0.0334 [get_ports {FrameStrobe_O[3]}]
set_load -pin_load 0.0334 [get_ports {FrameStrobe_O[2]}]
set_load -pin_load 0.0334 [get_ports {FrameStrobe_O[1]}]
set_load -pin_load 0.0334 [get_ports {FrameStrobe_O[0]}]
set_load -pin_load 0.0334 [get_ports {N1BEG[3]}]
set_load -pin_load 0.0334 [get_ports {N1BEG[2]}]
set_load -pin_load 0.0334 [get_ports {N1BEG[1]}]
set_load -pin_load 0.0334 [get_ports {N1BEG[0]}]
set_load -pin_load 0.0334 [get_ports {N2BEG[7]}]
set_load -pin_load 0.0334 [get_ports {N2BEG[6]}]
set_load -pin_load 0.0334 [get_ports {N2BEG[5]}]
set_load -pin_load 0.0334 [get_ports {N2BEG[4]}]
set_load -pin_load 0.0334 [get_ports {N2BEG[3]}]
set_load -pin_load 0.0334 [get_ports {N2BEG[2]}]
set_load -pin_load 0.0334 [get_ports {N2BEG[1]}]
set_load -pin_load 0.0334 [get_ports {N2BEG[0]}]
set_load -pin_load 0.0334 [get_ports {N2BEGb[7]}]
set_load -pin_load 0.0334 [get_ports {N2BEGb[6]}]
set_load -pin_load 0.0334 [get_ports {N2BEGb[5]}]
set_load -pin_load 0.0334 [get_ports {N2BEGb[4]}]
set_load -pin_load 0.0334 [get_ports {N2BEGb[3]}]
set_load -pin_load 0.0334 [get_ports {N2BEGb[2]}]
set_load -pin_load 0.0334 [get_ports {N2BEGb[1]}]
set_load -pin_load 0.0334 [get_ports {N2BEGb[0]}]
set_load -pin_load 0.0334 [get_ports {N4BEG[15]}]
set_load -pin_load 0.0334 [get_ports {N4BEG[14]}]
set_load -pin_load 0.0334 [get_ports {N4BEG[13]}]
set_load -pin_load 0.0334 [get_ports {N4BEG[12]}]
set_load -pin_load 0.0334 [get_ports {N4BEG[11]}]
set_load -pin_load 0.0334 [get_ports {N4BEG[10]}]
set_load -pin_load 0.0334 [get_ports {N4BEG[9]}]
set_load -pin_load 0.0334 [get_ports {N4BEG[8]}]
set_load -pin_load 0.0334 [get_ports {N4BEG[7]}]
set_load -pin_load 0.0334 [get_ports {N4BEG[6]}]
set_load -pin_load 0.0334 [get_ports {N4BEG[5]}]
set_load -pin_load 0.0334 [get_ports {N4BEG[4]}]
set_load -pin_load 0.0334 [get_ports {N4BEG[3]}]
set_load -pin_load 0.0334 [get_ports {N4BEG[2]}]
set_load -pin_load 0.0334 [get_ports {N4BEG[1]}]
set_load -pin_load 0.0334 [get_ports {N4BEG[0]}]
set_load -pin_load 0.0334 [get_ports {NN4BEG[15]}]
set_load -pin_load 0.0334 [get_ports {NN4BEG[14]}]
set_load -pin_load 0.0334 [get_ports {NN4BEG[13]}]
set_load -pin_load 0.0334 [get_ports {NN4BEG[12]}]
set_load -pin_load 0.0334 [get_ports {NN4BEG[11]}]
set_load -pin_load 0.0334 [get_ports {NN4BEG[10]}]
set_load -pin_load 0.0334 [get_ports {NN4BEG[9]}]
set_load -pin_load 0.0334 [get_ports {NN4BEG[8]}]
set_load -pin_load 0.0334 [get_ports {NN4BEG[7]}]
set_load -pin_load 0.0334 [get_ports {NN4BEG[6]}]
set_load -pin_load 0.0334 [get_ports {NN4BEG[5]}]
set_load -pin_load 0.0334 [get_ports {NN4BEG[4]}]
set_load -pin_load 0.0334 [get_ports {NN4BEG[3]}]
set_load -pin_load 0.0334 [get_ports {NN4BEG[2]}]
set_load -pin_load 0.0334 [get_ports {NN4BEG[1]}]
set_load -pin_load 0.0334 [get_ports {NN4BEG[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {UserCLK}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {FrameStrobe[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {FrameStrobe[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {FrameStrobe[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {FrameStrobe[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {FrameStrobe[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {FrameStrobe[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {FrameStrobe[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {FrameStrobe[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {FrameStrobe[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {FrameStrobe[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {FrameStrobe[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {FrameStrobe[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {FrameStrobe[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {FrameStrobe[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {FrameStrobe[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {FrameStrobe[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {FrameStrobe[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {FrameStrobe[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {FrameStrobe[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {FrameStrobe[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S1END[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S1END[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S1END[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S1END[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S2END[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S2END[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S2END[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S2END[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S2END[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S2END[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S2END[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S2END[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S2MID[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S2MID[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S2MID[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S2MID[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S2MID[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S2MID[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S2MID[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S2MID[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S4END[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S4END[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S4END[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S4END[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S4END[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S4END[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S4END[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S4END[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S4END[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S4END[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S4END[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S4END[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S4END[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S4END[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S4END[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {S4END[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {SS4END[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {SS4END[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {SS4END[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {SS4END[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {SS4END[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {SS4END[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {SS4END[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {SS4END[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {SS4END[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {SS4END[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {SS4END[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {SS4END[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {SS4END[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {SS4END[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {SS4END[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {SS4END[0]}]
###############################################################################
# Design Rules
###############################################################################
